let name = prompt("გთხოვთ, შეიყვანოთ თქვენი სახელი:");
let age = parseInt(prompt("გთხოვთ, შეიყვანოთ თქვენი ასაკი:"));
let distance = parseInt(prompt("გთხოვთ, შეიყვანოთ სამუშაო ადგილამდე მანძილი (კმ-ით):"));
let workDays = parseInt(prompt("გთხოვთ, შეიყვანოთ სამუშაო დღეების რაოდენობა კვირაში (0-დან 7-მდე):"));

if (age < 16) {
  alert("გთხოვთ, მოითხოვოთ გამგზავრების ნებართვა უფროსისგან.");
} else if (age >= 16 && age < 65) {
  if (distance >= 0 && distance <= 5) {
    alert("რეკომენდირებული ტრანსპორტი: ველოსიპედი.");
  } else if (distance > 5 && distance <= 20) {
    alert("რეკომენდირებული ტრანსპორტი: მანქანა.");
  } else if (distance > 20) {
    alert("რეკომენდირებული ტრანსპორტი: მატარებელი.");
  }
}

if (workDays >= 5) {
  alert("თქვენ შეგიძლიათ სცადოთ შეღავათები ტრანსპორტზე.");
}




let n = prompt("გთხოვთ, შეიყვანოთ თქვენი სახელი:");
let a = parseInt(prompt("გთხოვთ, შეიყვანოთ თქვენი ასაკი:"));
let runningDistancePerDay = parseFloat(prompt("გთხოვთ, შეიყვანოთ თქვენი ყოველდღიური სირბილის რაოდენობა (კილომეტრებში):"));
let exerciseDaysPerWeek = parseInt(prompt("გთხოვთ, შეიყვანოთ სავარჯიშო დღეების რაოდენობა კვირაში (0-დან 7-მდე):"));

if (age < 16 || age >= 60) {
  alert("გთხოვთ, გაიაროთ ექიმის კონსულტაცია.");
}

let wRD = rDPD * eDPW;

if (wRD < 20) {
  alert("შესაძლებელია მეტი ვარჯიში.");
}